<template>
	<div class="webinars">
		<!-- card 1 -->
		<div class="webinars-card">
			<iframe
				class="webinars-video"
				width="330"
				height="170"
				src="https://www.youtube.com/embed/s5vCsPAxtR8?si=LiqSAWWY6InPN_t1"
				title="YouTube video player"
				frameborder="0"
				allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share"
				referrerpolicy="strict-origin-when-cross-origin"
				allowfullscreen
			></iframe>
			<h2>
				Феномен колективної травми в контексті сучасного українського
				досвіду
			</h2>
			<p>
				Вебінар проводить: Наталя Фролова - психологиня Служби турботи
				про психічне здоров'я На вебінарі дізнаємось про: Структуру
				колективної травми та особливості її впливу на психіку людини.
				Специфіку колективного травмування українців в період
				повномасштабного вторгнення 2022. Конструктивні шляхи подолання
				наслідків колективного травмування українців.
			</p>
		</div>

		<!-- card 2 -->
		<div class="webinars-card">
			<iframe
				class="webinars-video"
				width="330"
				height="170"
				src="https://www.youtube.com/embed/KEXzYVmgKqY?si=MIxiku45gX8h8xTU"
				title="YouTube video player"
				frameborder="0"
				allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share"
				referrerpolicy="strict-origin-when-cross-origin"
				allowfullscreen
			></iframe>
			<h2>
				Коли чекаєш військових з війни: як можна підготуватись до
				повернення?
			</h2>
			<p>
				На події ми поговоримо про що треба знати усім, хто чекає
				повернення своїх рідних, друзів, співробітників. 👥Війна змінює
				людину, тому, не лякайтесь, що до вас повернеться така
				знайома-незнайома людина. З новими звичками, новими словами,
				дивними проявами у поведінці. Вам доведеться знайомитися заново!
				Пізнавати один одного, домовлятися про нові правила поведінки,
				прояви поваги, стосунки і таке інше. На що потрібно звертати
				увагу, що можна, а що не можна робити, як можна підготуватися до
				повернення.
			</p>
		</div>

		<!-- card 3 -->
		<div class="webinars-card">
			<iframe
				class="webinars-video"
				width="330"
				height="170"
				src="https://www.youtube.com/embed/ReITSQjupZA?si=D82CL67cUyWM-pp5"
				title="YouTube video player"
				frameborder="0"
				allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share"
				referrerpolicy="strict-origin-when-cross-origin"
				allowfullscreen
			></iframe>
			<h2>Емоційна зрілість: чому вона важлива?</h2>
			<p>
				Ірина Івлєва - психологиня Служби турботи про психічне здоров'я
				✅Поговоримо про те, що таке емоційна зрілість і як вона
				формується. ✅Познайомимося зі складовими емоційної зрілості,
				подумаємо, які необхідно мати кожному з нас. ✅Повчимося любити
				навіть тоді, коли нас не розуміють, просити стільки, скільки
				потрібно, встановлювати обмеження на те, скільки ви можете дати.
			</p>
		</div>

		<!-- card 4 -->
		<div class="webinars-card">
			<iframe
				class="webinars-video"
				width="330"
				height="170"
				src="https://www.youtube.com/embed/DcBGLH25T44?si=706msDarMOP4NwRh"
				title="YouTube video player"
				frameborder="0"
				allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share"
				referrerpolicy="strict-origin-when-cross-origin"
				allowfullscreen
			></iframe>
			<h2>
				Спорт та фізкультура: як тримати емоційний баланс та попередити
				вигорання?
			</h2>
			<p>
				А ви любите спорт? На вебінарі "Спорт та фізкультура: як тримати
				емоційний баланс та попередити вигорання?" будемо говорити про
				емоційне вигорання та стрес. Про те чому до цього слід ставитись
				серйозно і в чому "невидима" небезпека. Як це впливає на якість,
				розвиток і ефективність життя в наших реаліях. 🤸А також чому
				спорт та фізкультура - це один з найбільш ефективних і
				доступних, а також неймовірно корисних засобів для подолання і
				профілактики емоційного вигорання.
			</p>
		</div>

		<!-- card 5 -->
		<div class="webinars-card">
			<iframe
				class="webinars-video"
				width="330"
				height="160"
				src="https://www.youtube.com/embed/xRgwAgKdPr4?si=Bz6JDtoci9nLiri_"
				title="YouTube video player"
				frameborder="0"
				allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share"
				referrerpolicy="strict-origin-when-cross-origin"
				allowfullscreen
			></iframe>
			<h2>Безпека жінки у цифровому світі</h2>
			<p>
				З кібербулінгом та насиллям в інтернеті досі стикаються жінки в
				усьому світі. В тому числі, в Україні. Потрібно знати, як
				вберегтися від цього та що робити, якщо ви зазнали насилля
				онлайн 👥На вебінарі Ольга Золотар - юристка, клінічна
				психологиня, коордитаторка Західного регіону Служби турботи про
				психічне здоров'я та Ірина Руденко - психотерапевтка Служби
				розкажуть про те, як налаштувати безпечну комунікацію в інтернет
				середовищі: 🔸психологічна готовність, здібності і навички; 🔸як
				запобігти віртуальному/кібер насильству; 🔸що робити, якщо все ж
				сталося.
			</p>
		</div>
	</div>
</template>

<script>
import { auth } from "../firebase";
import { onAuthStateChanged } from "firebase/auth";

export default {
	name: "WebinarsView",

	mounted() {
		onAuthStateChanged(auth, (user) => {
			if (user) {
				this.user = user;
			} else {
				this.$router.push("/login");
			}
		});
	},
};
</script>

<style scoped>
iframe {
	border-radius: 16px;
}

.webinars-card {
	display: flex;
	flex-direction: column;
	justify-content: center;
	align-items: center;
	padding: 20px 30px;
	margin: 20px 10px;
	border-radius: 20px;
	/* box-shadow: 0 -3px 5px rgba(0, 0, 0, 0.2); */
}

.webinars-card h2 {
	padding-top: 5px;
	font-size: 16px;
	font-weight: 600;
	text-align: left;
}

.webinars-card p {
	font-size: 14px;
	text-align: justify;
}
</style>
