import war1 from "../assets/war1.jpg";
import war2 from "../assets/war2.jpg";
import war3 from "../assets/war3.jpg";
import war4 from "../assets/war4.jpg";
import happiness1 from "../assets/happiness1.jpg";
import happiness2 from "../assets/happiness2.jpg";
import happiness3 from "../assets/happiness3.jpg";
import happiness4 from "../assets/happiness4.jpg";
import self1 from "../assets/self1.jpg";
import self2 from "../assets/self2.jpg";
import self3 from "../assets/self3.jpg";
import self4 from "../assets/self4.jpg";
import recovery1 from "../assets/recovery1.jpg";
import recovery2 from "../assets/recovery2.jpg";
import recovery3 from "../assets/recovery3.jpg";
import recovery4 from "../assets/recovery4.jpg";
import emotions1 from "../assets/emotions1.jpg";
import emotions2 from "../assets/emotions2.jpg";
import emotions3 from "../assets/emotions3.jpg";
import emotions4 from "../assets/emotions4.jpg";
import relationship1 from "../assets/relationship1.jpg";
import relationship2 from "../assets/relationship2.jpg";
import relationship3 from "../assets/relationship3.jpg";
import relationship4 from "../assets/relationship4.jpg";
// war
import war1Audio from "../assets/war1Audio.mp3";
import war2Audio from "../assets/war2Audio.mp3";
import war3Audio from "../assets/war3Audio.mp3";
import war4Audio from "../assets/war4Audio.mp3";

// happiness
import happiness1Audio from "../assets/happiness1Audio.mp3";
import happiness2Audio from "../assets/happiness2Audio.mp3";
import happiness3Audio from "../assets/happiness3Audio.mp3";
import happiness4Audio from "../assets/happiness4Audio.mp3";

// self-realization
import selfRealization1Audio from "../assets/self-realization1Audio.mp3";
import selfRealization2Audio from "../assets/self-realization2Audio.mp3";

// recovery
import recovery1Audio from "../assets/recovery1Audio.mp3";
import recovery2Audio from "../assets/recovery2Audio.mp3";
import recovery3Audio from "../assets/recovery3Audio.mp3";

// Emotions
import emotions1Audio from "../assets/emotions1Audio.mp3";
import emotions2Audio from "../assets/emotions2Audio.mp3";

// Relationship
import relationship1Audio from "../assets/relationship1Audio.mp3";
import relationship2Audio from "../assets/relationship2Audio.mp3";

export const sections = [
	{
		title: "War",
		items: [
			{
				id: "1",
				title: "Подолання травми",
				image: war1,
				description:
					"Психологічна травма може залишити глибокий слід після пережитих стресових подій. Важливо розуміти, як вона проявляється і як з нею справлятися. Цей розділ допоможе вам знайти методи підтримки, щоб поступово повернутися до нормального життя. Підвищення усвідомленості та надання собі дозволу на відновлення — це перші кроки до відновлення вашої внутрішньої сили.",
				clickable: true,
				completed: false,
				music: war1Audio,
			},
			{
				id: "2",
				title: "Від страху до нового життя",
				image: war2,
				description:
					"Переживання страху після важких подій — це природна реакція, але важливо навчитися долати цей страх. Ви можете розвинути навички, які дозволять адаптуватися до нових реалій і розпочати нове життя. Важливо змінити ставлення до страху, сприймати його як частину шляху до саморозвитку. В цьому розділі ви знайдете стратегії для переходу від страху до внутрішньої впевненості.",
				clickable: true,
				completed: false,
				music: war2Audio,
			},
			{
				id: "3",
				title: "Панічні атаки",
				image: war3,
				description:
					"Панічні атаки можуть бути дуже лякаючими, але вони не є небезпечними для фізичного здоров’я. Важливо зрозуміти, чому вони відбуваються, і як з ними справлятися. Цей розділ надасть вам прості техніки для заспокоєння та зниження тривоги. Ваша мета — відновити контроль над своїми емоціями та відчути себе спокійно навіть у важких ситуаціях.",
				clickable: true,
				completed: false,
				music: war3Audio,
			},
			{
				id: "4",
				title: "Як вижити та перемогти",
				image: war4,
				description:
					"Життя після важких випробувань вимагає від вас великої сили духу. У цьому розділі ви дізнаєтесь, як знайти внутрішній ресурс, щоб не лише вижити, а й перемогти труднощі. Через усвідомлені кроки ви зможете знову відчути радість і спокій. Трансформація, що відбувається в результаті, може призвести до нового, більш здорового етапу життя.",
				clickable: true,
				completed: false,
				music: war4Audio,
			},
		],
	},
	{
		title: "Happiness",
		items: [
			{
				id: "6",
				title: "Прийняття своєї ваги, віку та зовнішності",
				image: happiness1,
				description:
				"Важливо приймати себе в тому вигляді, в якому ви є, і не зраджувати своєму тілу через суспільні стандарти. Прийняття свого тіла, віку і зовнішності — це крок до внутрішнього спокою і гармонії. У цьому розділі ви дізнаєтесь, як перестати порівнювати себе з іншими і полюбити своє тіло, що є основою для щастя. Крок за кроком ви навчитесь вірити в свою унікальність і красу.",
				clickable: true,
				completed: false,
				music: happiness2Audio,
			},
			{
				id: "7",
				title: "Здорова самооцінка ",
				image: happiness2,
				description:
				"Самооцінка є основою вашого психічного благополуччя. Здорова самооцінка дозволяє вам приймати себе таким, яким ви є, з усіма сильними і слабкими сторонами. В цьому розділі ви знайдете методи, які допоможуть вам побудувати впевненість у собі, а також прийняти свої недосконалості. Ваша ціль — досягти внутрішнього балансу та відчуття гідності, незалежно від зовнішніх факторів.",
				clickable: true,
				completed: false,
				music: happiness1Audio,
			},
			{
				id: "8",
				title: "7 принципів щасливого життя",
				image: happiness3,
				description:
				"Щастя — це не випадковість, а результат свідомих дій. У цьому розділі ви дізнаєтесь про сім ключових принципів, які допоможуть вам досягти справжнього щастя в житті. Це принципи, що базуються на здорових відносинах, внутрішньому розвитку та здатності насолоджуватись кожним моментом. Практикуючи їх, ви зможете створити життя, яке приносить задоволення та гармонію.",
				clickable: true,
				completed: false,
				music: happiness4Audio,
			},
			{
				id: "9",
				title: "Антистрес",
				image: happiness4,
				description:
				"Стрес може бути не лише шкідливим для здоров’я, але й причиною негативних емоцій. В цьому розділі ви знайдете способи боротьби з постійним стресом та тривогою. Ми пропонуємо практичні вправи для зниження рівня стресу, розслаблення і відновлення емоційної рівноваги. Цей розділ допоможе вам знайти внутрішній спокій, навіть коли навколо хаос.",
				clickable: true,
				completed: false,
				music: happiness3Audio,
			},
		],
	},
	{
		title: "Self-realization",
		items: [
			{
				id: "10",
				title: "Розкриття потенціалу",
				image: self1,
				description:
					"Розкриття вашого потенціалу — це процес пізнання та розвитку своїх сильних сторін. Важливо вірити в свої можливості та ставити перед собою амбітні цілі. У цьому розділі ми поділимось ефективними методами саморозвитку, які допоможуть вам досягти успіху у будь-якій сфері. Дозвольте собі зрозуміти, на що ви здатні, і ви побачите, як ваш потенціал почне розвиватися.",
				clickable: true,
				completed: false,
				music: selfRealization1Audio,
			},
			{
				id: "11",
				title: "Відпустити минуле та вирушити у майбутнє",
				image: self2,
				description:
					"Минуле може бути тяжким тягарем, який заважає рухатись вперед. Важливо вміти відпустити старі образи та переживання, щоб не застрягти в них. Цей розділ надасть вам методи звільнення від минулого і допоможе зосередитись на побудові майбутнього. Підхід до прощення та зцілення дозволить вам зробити крок у нове, більш світле життя.",
				clickable: true,
				completed: false,
				music: selfRealization2Audio,
			},
			{
				id: "12",
				title: "Трансформація внутрішнього світу",
				image: self3,
				description:
					"Зміни, що відбуваються всередині нас, здатні змінити все навколо. Внутрішня трансформація дозволяє подолати обмеження і вийти на новий рівень розвитку. У цьому розділі ми поділимось техніками, які допоможуть вам змінити своє ставлення до себе і світу. Ваша внутрішня трансформація стане основою для досягнення великих цілей.",
				clickable: false,
			},
			{
				id: "13",
				title: "Створення нового себе",
				image: self4,
				description:
					"Створення нового себе — це процес, що включає переосмислення своїх цінностей, переконань і прагнень. У цьому розділі ми розглянемо, як побудувати свою нову ідентичність і визначити, хто ви хочете бути. Це допоможе вам не тільки змінити своє життя, але й стати справжньою версією себе. Шлях до нового себе — це шлях до щастя і реалізації.",
				clickable: false,
			},
		],
	},
	{
		title: "Recovery",
		items: [
			{
				id: "14",
				title: "Вихід із особистої кризи",
				image: recovery1,
				description:
					"Особиста криза може бути одним з найбільших випробувань у житті. Вона може виникнути через втрату роботи, відносин чи великих змін. Важливо вміти розпізнати ці моменти і діяти вчасно, щоб не застрягти в цій стадії. У цьому розділі ми пропонуємо стратегії, які допоможуть вам розібратися в ситуації, знайти вихід із кризових ситуацій і відновити внутрішню рівновагу.",
				clickable: true,
				completed: false,
				music: recovery2Audio,
			},
			{
				id: "15",
				title: "Вихід із депресії",
				image: recovery2,
				description:
				"Депресія — це важке психічне захворювання, яке може впливати на всі сфери життя. Важливо вчасно розпізнати симптоми депресії та звернутися за допомогою. У цьому розділі ми навчимо вас методам самодопомоги, які допоможуть полегшити стан і поступово вийти з депресії. Ви також дізнаєтесь про важливість підтримки оточуючих і професіоналів для вашого відновлення.",
				clickable: true,
				completed: false,
				music: recovery1Audio,
			},
			{
				id: "16",
				title: "Перемога над тривожністю",
				image: recovery3,
				description:
					"Тривожність — це часте і часто виснажливе переживання, яке може заважати нормальному життю. Цей розділ допоможе вам зрозуміти причини тривоги і знайти способи для її подолання. Ми поділимось техніками заспокоєння та методами, які допоможуть вам позбутися постійного почуття тривоги. Практикуючи ці вправи, ви зможете знову почати жити вільно та без страху.",
				clickable: true,
				completed: false,
				music: recovery3Audio,
			},
			{
				id: "17",
				title: "Відновлення після травми",
				image: recovery4,
				description:
					"Травма, будь-то фізична чи емоційна, може залишити довготривалі наслідки. Процес відновлення — це не тільки фізичне, а й емоційне лікування. Цей розділ допоможе вам зрозуміти, як відновити емоційну рівновагу, працюючи над своїми переживаннями та страхами. Ви дізнаєтесь, як розпочати шлях до зцілення і знайти сили для відновлення після важких моментів у житті.",
				clickable: false,
			},
		],
	},
	{
		title: "Emotions",
		items: [
			{
				id: "18",
				title: "Керування гнівом",
				image: emotions1,
				description:
					"Гнів — це природна емоція, але коли вона виходить з-під контролю, вона може завдати шкоди вам і оточуючим. В цьому розділі ви дізнаєтесь, як розпізнати почуття гніву та навчитися контролювати його. Ми поділимось техніками, які допоможуть вам знизити рівень агресії та знайти здорові способи вираження своїх емоцій. Керуючи своїм гнівом, ви зможете підтримувати гармонію в особистих та професійних відносинах.",
				clickable: true,
				completed: false,
				music: emotions1Audio,
			},
			{
				id: "19",
				title: "Емоційна зрілість",
				image: emotions2,
				description:
					"Емоційна зрілість — це здатність правильно сприймати і реагувати на свої емоції, а також емоції інших. У цьому розділі ви дізнаєтесь, як розвивати емоційну інтелігентність, керувати своїми реакціями і розуміти емоції оточуючих. Емоційна зрілість допомагає створювати здорові стосунки і адаптуватися до різних ситуацій. Ви навчитесь, як розвивати цю важливу якість для досягнення гармонії в житті.",
				clickable: true,
				completed: false,
				music: emotions2Audio,
			},
			{
				id: "20",
				title: "Робота з тривогою",
				image: emotions3,
				description:
					"Тривога — це емоція, що часто виникає перед невідомим або потенційно небезпечним, але вона може бути керованою. У цьому розділі ви дізнаєтесь, як працювати з тривогою, знижуючи її вплив на ваше життя. Це допоможе вам відновити відчуття спокою і контролю, а також впоратися з ситуаціями, які раніше викликали сильні переживання. З часом ви навчитесь перемагати тривогу за допомогою практик та усвідомлених дій.",
				clickable: false,
			},
			{
				id: "21",
				title: "Стратегії подолання стресу",
				image: emotions4,
				description:
					"Стрес — це реакція організму на зовнішні чи внутрішні труднощі, але коли стрес стає постійним, він починає впливати на здоров'я. У цьому розділі ви знайдете техніки, які допоможуть знизити рівень стресу і відновити емоційну рівновагу. Ви дізнаєтесь про методи релаксації, медитації та іншого, що допомагає впоратися зі стресом і повернути гармонію в життя. З часом ці стратегії стануть частиною вашої щоденної практики.",
				clickable: false,
			},
		],
	},
	{
		title: "Relationship",
		items: [
			{
				id: "22",
				title: "Особисті кордони",
				image: relationship1,
				description:
					"Встановлення здорових особистих кордонів — це основа для підтримки гармонійних відносин. Вони допомагають захистити себе від емоційного вигорання і зберегти свою самоповагу. У цьому розділі ви дізнаєтесь, як визначити свої кордони та правильно їх комунікувати з оточенням. Це допоможе вам уникнути маніпуляцій та побудувати здорові відносини з іншими людьми.",
				clickable: true,
				completed: false,
				music: relationship1Audio,
			},
			{
				id: "23",
				title: "Переживання розставання",
				image: relationship2,
				description:
					"Розставання можуть бути болючими і важкими для емоційного відновлення. Важливо дати собі час для переживання втрати і зцілення. У цьому розділі ви знайдете поради щодо того, як пережити розставання і як відновити емоційний баланс після цього. Ми допоможемо вам знайти способи відновлення і рухатись далі з новими силами.",
				clickable: true,
				completed: false,
				music: relationship2Audio,
			},
			{
				id: "24",
				title: "Збереження гармонії в стосунках",
				image: relationship3,
				description:
					"Сильні і гармонійні стосунки потребують постійної уваги та взаємопідтримки. У цьому розділі ви дізнаєтесь, як будувати взаєморозуміння, працювати над конфліктами і підтримувати емоційну близькість з партнерами. Ви навчитесь шукати баланс між особистим простором і спільним часом, що зміцнює відносини на довгі роки. Гармонійні стосунки — це результат постійної роботи над собою та своїми відносинами.",
				clickable: false,
			},
			{
				id: "25",
				title: "Розвиток взаємної довіри",
				image: relationship4,
				description:
					"Довіра — основа будь-яких здорових стосунків. Без неї неможливо побудувати міцні і щасливі відносини. У цьому розділі ви дізнаєтесь, як побудувати і підтримувати довіру в стосунках. Це допоможе вам покращити свої взаємодії з іншими і зміцнити емоційну близькість з близькими людьми.",
				clickable: false,
			},
		],
	},
];
